{
  "backend/main.mo": "Minimal Motoko backend actor with no methods or state defined.",
  "feature_evidence.json": "Feature evidence report confirming that the authDomain field in frontend/src/firebase.ts was updated to 'yourdomain.com' with high confidence, tied to test REQ-51.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file for the Zweeti Fast Food Billing app.",
  "frontend/index.css": "Tailwind CSS entry file that defines OKLCH-based CSS custom properties for light and dark themes including colors, radius, sidebar, and chart tokens.",
  "frontend/index.html": "HTML entry point for the Zweeti Fast Food Billing app, loading Nunito fonts from Google Fonts and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app component implementing Firebase OTP phone authentication (with pre-filled test credentials), billing item management, GST toggle, daily sales totals, date-wise sales report, and print functionality.",
  "frontend/src/components/BillingForm.tsx": "Billing form component with a 13-item Zweeti menu selector, quantity input, and an Add Item button that dispatches items to the parent via a callback.",
  "frontend/src/components/BillSummary.tsx": "Bill summary component rendering a two-column item/price table with a tfoot total row, GST toggle, subtotal/GST breakdown, and item removal support.",
  "frontend/src/firebase.ts": "Firebase Auth stub that exports firebaseConfig (authDomain set to 'yourdomain.com'), an auth instance, RecaptchaVerifier class, and signInWithPhoneNumber function mirroring the real Firebase Auth API without requiring the firebase npm package.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Identity authentication via AuthClient, exposing login/clear functions and login status.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities and Zweeti Pro brand CSS custom properties, component classes (cards, buttons, table rows, header) using the orange/green/blue brand palette.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Zweeti brand colors, Nunito font, OKLCH CSS variable-based semantic color tokens, and plugins for animation, typography, and container queries.",
  "project_state.json": "Project state snapshot (version 65) describing the Zweeti Fast Food Billing app's architecture, existing features, known issues, and design decisions including Firebase OTP auth, GST toggle, and print-to-PDF functionality."
}