{
  "backend/main.mo": "Minimal Motoko backend actor with no methods or state defined.",
  "feature_evidence.json": "Feature evidence report mapping three login/logout-related feature requirements (REQ-36, REQ-37, REQ-38) to App.tsx, covering auto-login on mount, logout button, and 10-digit mobile validation.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file for the Zweeti Fast Food Billing app.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Zweeti Fast Food Billing app, loading Nunito fonts from Google Fonts and mounting the React app at #root.",
  "frontend/src/App.tsx": "Main React app component implementing localStorage-based login (auto-login on mount if 'zweetiUser' exists, 10-digit mobile validation, logout with page reload) and the billing UI with invoice generation, daily totals, GST calculation, and date-wise sales report.",
  "frontend/src/components/BillingForm.tsx": "Billing form component with a 13-item Zweeti menu dropdown, quantity input, and an Add Item button that validates input and calls the onAddItem callback.",
  "frontend/src/components/BillSummary.tsx": "Bill summary component rendering a two-column item/price table with a tfoot total row, GST toggle, and subtotal/GST/grand-total breakdown that recalculates via useEffect when items or GST setting change.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, invalidating dependent queries whenever the actor or identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS with ZWEETI Pro brand tokens (orange, green, blue), OKLCH CSS variables for theming, and custom component classes for cards, buttons, tables, and layout.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with ZWEETI brand colors, Nunito font, OKLCH-based semantic color tokens, and plugins for animation, typography, and container queries.",
  "project_state.json": "Tracks the project state and version history for the Zweeti Fast Food Billing app, documenting architectural decisions, existing features, and known issues."
}