{
  "backend/main.mo": "Minimal Motoko backend actor with no methods or state defined.",
  "feature_evidence.json": "Feature evidence report confirming that the auto-generated Invoice Number (ZWT-YYYYMMDD-XXXX) and Date (DD/MM/YYYY) fields were implemented in App.tsx, with high confidence tied to test REQ-9.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file for the Zweeti Fast Food Billing app.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, including colors for background, foreground, card, sidebar, and chart elements.",
  "frontend/index.html": "HTML entry point for the Zweeti Fast Food Billing app, loading Nunito and Nunito Sans fonts from Google Fonts and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app component managing billing state, auto-generating an invoice number and formatted date on load or clear, and providing print and PDF download functionality via html2pdf.js.",
  "frontend/src/components/BillingForm.tsx": "Billing form component with a 13-item menu dropdown, quantity input, and an Add Item button that validates input and calls the parent's onAddItem callback.",
  "frontend/src/components/BillSummary.tsx": "Bill summary component rendering a styled table of bill items with remove buttons, subtotal, 5% GST, and grand total, using Zweeti's orange theme and dashed borders.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status flags.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/components/utilities, ZWEETI Pro brand CSS variables (orange, green, blue), reusable component classes for cards, buttons, tables, and print styles.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with ZWEETI brand colors, Nunito font, OKLCH CSS variable-based semantic color tokens, and plugins for animation, typography, and container queries.",
  "project_state.json": "Tracks the project's current state, version, architectural notes, known issues, and implemented features for the ZWEETI Fast Food Billing app."
}