{
  "backend/main.mo": "Minimal Motoko backend actor with no methods or state defined.",
  "feature_evidence.json": "Feature evidence report file with an empty features list, indicating no features have been documented yet.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file for the Zweeti Fast Food Billing app.",
  "frontend/index.css": "Tailwind CSS entry file that defines OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, card, sidebar, and chart colors.",
  "frontend/index.html": "HTML entry point for the Zweeti Fast Food Billing app that loads Nunito fonts from Google Fonts and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app component implementing Firebase OTP phone authentication (pre-filled with test credentials), billing state management, GST toggle, daily sales totals via localStorage, and date-wise sales report functionality.",
  "frontend/src/components/BillingForm.tsx": "Billing form component with a 13-item Zweeti menu selector, quantity input, and an Add Item button that validates input and calls the onAddItem callback.",
  "frontend/src/components/BillSummary.tsx": "Bill summary component rendering a two-column item/price table with GST toggle, subtotal/GST breakdown, and a tfoot total row; recalculates totals via useEffect whenever items or GST setting changes.",
  "frontend/src/firebase.ts": "Firebase Auth stub that exports a firebaseConfig, auth instance, RecaptchaVerifier class, signInWithPhoneNumber function, and ConfirmationResult interface, mirroring the real Firebase Auth API without requiring the firebase npm package.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Computer Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS with ZWEETI Pro brand tokens (orange, green, blue), OKLCH CSS variables for theming, and custom component classes for cards, buttons, tables, and layout.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with ZWEETI brand colors, Nunito font family, OKLCH-based semantic color tokens, and plugins for animation, typography, and container queries.",
  "project_state.json": "Tracks the project's current state (version 67) for the Zweeti Fast Food Billing app, documenting architectural decisions, existing features, and known issues including Firebase OTP auth and ICP Internet Identity integration."
}