{
  "backend/main.mo": "Defines an empty Motoko actor serving as the backend canister placeholder with no methods implemented.",
  "feature_evidence.json": "Feature evidence report mapping the PDF download feature (replacing plain-text download with html2pdf.js) to its implementation file App.tsx and associated test ID REQ-8.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file describing their roles in the ZWEETI Fast Food Billing app.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including colors, borders, and sidebar tokens.",
  "frontend/index.html": "HTML entry point for the Zweeti Fast Food Billing app that loads Nunito fonts from Google Fonts and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component managing billing state (customer name, items) and rendering the full ZWEETI Pro UI including a PDF download button that dynamically loads html2pdf.js from CDN to generate zweeti-bill.pdf.",
  "frontend/src/components/BillingForm.tsx": "Billing form component with a 13-item Zweeti menu dropdown, quantity input, and an Add Item button that validates input and calls the onAddItem callback.",
  "frontend/src/components/BillSummary.tsx": "Displays the bill summary table with item rows, remove buttons, and a totals section showing subtotal, 5% GST, and grand total with ZWEETI Pro orange styling.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, recreating it when the Internet Identity changes and invalidating dependent queries accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state with status tracking.",
  "frontend/src/index.css": "Global CSS for the ZWEETI Pro billing app, defining Tailwind base/components/utilities, OKLCH CSS custom properties for theming, brand-specific component classes (buttons, cards, table styles), and print media styles.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with ZWEETI brand colors, Nunito font, OKLCH-based semantic color tokens, custom border radii, box shadows, and plugins for animation, typography, and container queries.",
  "project_state.json": "Project state metadata (version 9) describing the ZWEETI Fast Food Billing app's architecture, existing features, known issues, and design decisions including orange/green theming, 420px card width, GST at 5%, and html2pdf.js for PDF download."
}