{
  "backend/main.mo": "Minimal Motoko actor with no methods or state, serving as a placeholder backend canister.",
  "feature_evidence.json": "Feature evidence report file with an empty features array, indicating no features have been documented yet.",
  "frontend-file-summaries.txt": "JSON file containing short summaries of each frontend source file for the Zweeti Fast Food Billing app.",
  "frontend/index.css": "Tailwind CSS entry file that defines OKLCH-based CSS custom properties for light and dark themes including colors, radius, sidebar, and chart tokens.",
  "frontend/index.html": "HTML entry point that loads Nunito fonts from Google Fonts and mounts the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component for the Zweeti billing app that manages login (10-digit mobile gate), bill items, GST, daily totals persisted in localStorage, invoice generation, and date-wise sales reporting.",
  "frontend/src/components/BillingForm.tsx": "Billing form component with a 13-item Zweeti menu dropdown, quantity input, and an Add Item button that validates input and calls the onAddItem callback.",
  "frontend/src/components/BillSummary.tsx": "Bill summary component rendering a two-column item/price table with a grand total tfoot row, GST toggle, subtotal/GST breakdown, and per-item remove buttons.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor via React Query, recreating it when the Internet Identity changes and invalidating dependent queries accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and context provider that wraps DFINITY's AuthClient to manage Internet Identity login, logout, and identity persistence across page reloads.",
  "frontend/src/index.css": "Global stylesheet for the Zweeti Pro app that imports Tailwind directives and defines brand color CSS variables (orange, blue, green) plus OKLCH semantic tokens, along with reusable component classes for cards, buttons, tables, and layout.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped in QueryClientProvider (React Query) and InternetIdentityProvider for ICP authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Zweeti brand colors, Nunito font family, OKLCH-based semantic color tokens, custom border radii, box shadows, and plugins for animations, typography, and container queries.",
  "project_state.json": "Project state snapshot (version 45) describing the Zweeti Fast Food Billing app's architecture, existing features, known issues, and design decisions including gradient background, 420px container, GST toggle, invoice fields, and ICP login screen."
}