{
  "kind": "build_request",
  "title": "Add Invoice Number and Date fields to the bill display",
  "projectName": "Zweeti Billing",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Add an auto-generated Invoice Number and a Date field to the bill display in App.tsx. The Invoice Number must follow the format ZWT-YYYYMMDD-XXXX (where XXXX is a random 4-digit number), generated once when the page loads or a new bill is started. The Date must display the current date formatted as DD/MM/YYYY or a human-readable equivalent. Both fields must appear prominently near the top of the bill card, above the customer name section, with labels 'Invoice No:' and 'Date:' in bold. Both fields must be included in the printed bill and in the PDF generated by the Download Bill button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "<b>Invoice No:</b> <span id=\"invoiceNo\"></span>",
          "<b>Date:</b> <span id=\"billDate\"></span>",
          "ZWT-20260227-3842"
        ]
      },
      "acceptanceCriteria": [
        "An Invoice Number in the format ZWT-YYYYMMDD-XXXX is auto-generated and displayed on the bill card with the label 'Invoice No:' in bold.",
        "The current date is displayed on the bill card with the label 'Date:' in bold.",
        "Both Invoice No and Date appear above the customer name input, near the top of the bill card.",
        "Both fields are visible in the browser print output.",
        "Both fields are captured in the PDF generated by the Download Bill (html2pdf.js) button.",
        "The Invoice Number and Date fields are read-only and not editable by the user."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/ or frontend/src/main.tsx.",
    "Do not change the existing menu items, GST rate, or visual theme (orange #ff5722, grey #f2f2f2, 420px card).",
    "Invoice Number must follow the ZWT-YYYYMMDD-XXXX format as shown in the user's example."
  ],
  "nonGoals": [
    "Persisting invoice numbers to the backend.",
    "Allowing the user to manually edit the invoice number or date.",
    "Any changes to the menu, pricing, or totals calculation.",
    "Any changes to the Print Bill or Download Bill button styling or behavior beyond including the new fields in output."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}