{
  "kind": "build_request",
  "title": "Implement auto-login from localStorage and logout function for the login screen",
  "projectName": "Zweeti Pro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-36",
      "text": "In App.tsx, update the login screen logic so that on component mount (equivalent to window.onload), if 'zweetiUser' exists in localStorage, automatically skip the login screen and show the main billing UI directly — without requiring the user to re-enter their mobile number.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "// Auto login if already signed in\nwindow.onload = function(){\n    if(localStorage.getItem(\"zweetiUser\")){\n        showBilling();\n    }\n};"
        ]
      },
      "acceptanceCriteria": [
        "On page load, if localStorage contains the key 'zweetiUser', the login screen is not shown and the billing UI is displayed immediately.",
        "If localStorage does not contain 'zweetiUser', the login screen is shown as normal.",
        "The auto-login check runs once on component mount using a useEffect hook."
      ]
    },
    {
      "id": "REQ-37",
      "text": "In App.tsx, add a logout function that removes the 'zweetiUser' key from localStorage and reloads the page (location.reload()), effectively returning the user to the login screen. Add a 'Logout' button visible in the main billing UI (hidden during print) that calls this logout function when clicked.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "function logout(){\n    localStorage.removeItem(\"zweetiUser\");\n    location.reload();\n}"
        ]
      },
      "acceptanceCriteria": [
        "A 'Logout' button is visible in the main billing UI and hidden during print (using the no-print CSS class).",
        "Clicking 'Logout' removes the 'zweetiUser' key from localStorage.",
        "After logout, the page reloads and the login screen is displayed.",
        "The logout button is styled consistently with the existing action buttons (full-width, border-radius 8px, appropriate background color)."
      ]
    },
    {
      "id": "REQ-38",
      "text": "In App.tsx, update the login validation so that when the user enters a mobile number and clicks 'Continue', if the input is not exactly 10 digits, an alert is shown with the message 'Enter valid 10 digit mobile number' (matching the reference script behavior), and the login is aborted. If valid, store the mobile number in localStorage under the key 'zweetiUser' and show the billing screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "if(mobile.length !== 10){\n        alert(\"Enter valid 10 digit mobile number\");\n        return;\n    }\n\n    localStorage.setItem(\"zweetiUser\", mobile);\n    showBilling();"
        ]
      },
      "acceptanceCriteria": [
        "If the entered mobile number is not exactly 10 digits, an alert displays 'Enter valid 10 digit mobile number' and the billing screen is not shown.",
        "If the entered mobile number is exactly 10 digits, it is stored in localStorage under the key 'zweetiUser'.",
        "After successful login, the login screen is hidden and the billing UI is shown.",
        "The existing inline error message approach in the login screen (if any) is reconciled with or replaced by this alert-based validation to match the reference script."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/ or frontend/src/main.tsx.",
    "The localStorage key for storing the logged-in user must be exactly 'zweetiUser'.",
    "All login/logout logic must be implemented in App.tsx as React state and useEffect patterns — no vanilla JS window.onload or direct DOM manipulation."
  ],
  "nonGoals": [
    "Backend authentication or server-side session management.",
    "Internet Identity or any other authentication provider beyond the mobile number gate.",
    "Any changes to the billing form, bill summary, daily sales report, or date-wise report features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}