{
  "kind": "build_request",
  "title": "Show billing screen after login (billingScreen div visibility fix)",
  "projectName": "Zweeti Pro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-36",
      "text": "In App.tsx, ensure that after the user successfully completes login (enters a valid 10-digit mobile number and clicks 'Continue'), the main billing UI — which corresponds to the billing screen container — is made visible (display: block or equivalent). The billing screen must be hidden (display: none) before login and fully visible after a successful login validation. This must work with the existing React state-based login gate logic already present in App.tsx.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "<div id=\"billingScreen\" style=\"display:none;\">",
          "<!-- Yahin aapka poora billing app rahega -->"
        ]
      },
      "acceptanceCriteria": [
        "When the app loads, the main billing UI (billing screen) is not visible — only the login screen is shown.",
        "After the user enters a valid 10-digit mobile number and clicks 'Continue', the login screen is hidden and the billing screen becomes fully visible.",
        "If the mobile number is invalid (not 10 digits), the billing screen remains hidden and an error message is shown.",
        "The billing screen container corresponds to the section that houses BillingForm, BillSummary, invoice details, daily/date-wise sales reports, and action buttons.",
        "The transition between login screen and billing screen is controlled by React state (not direct DOM style manipulation), consistent with the existing implementation pattern in App.tsx."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/ or frontend/src/components/ui/.",
    "Use React state to control login/billing screen visibility — do not use direct DOM manipulation.",
    "Do not change the existing login validation logic (10-digit mobile number check)."
  ],
  "nonGoals": [
    "Adding backend authentication or persisting login state.",
    "Changing the visual design of the login or billing screens.",
    "Modifying menu items, billing logic, GST toggle, or sales report features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}