{
  "kind": "build_request",
  "title": "Add localhost/127.0.0.1 to Firebase authorized domains",
  "projectName": "Zweeti Pro",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-50",
      "text": "In frontend/src/firebase.ts, update the Firebase app configuration to add 'localhost' and '127.0.0.1' as authorized domains for Firebase Authentication. Ensure the authDomain field in the firebaseConfig object continues to use the existing real project credentials, and that the RecaptchaVerifier initialization in App.tsx does not block or error when the app is served from localhost or 127.0.0.1. If the Firebase stub (mock) implementation is being used instead of the real firebase npm package, ensure the mock RecaptchaVerifier and signInWithPhoneNumber behave permissively when called from localhost so that OTP flow can be tested locally without Firebase rejecting the domain.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "localhost",
          "127.0.0.1"
        ]
      },
      "acceptanceCriteria": [
        "The app loads and the Firebase OTP login screen is displayed when served from http://localhost or http://127.0.0.1 without console errors related to unauthorized domains.",
        "The Send OTP button on the login screen does not throw a Firebase 'auth/unauthorized-domain' error when accessed via localhost or 127.0.0.1.",
        "The existing auto-login (zweetiUser in localStorage) still works correctly when the app is served from localhost or 127.0.0.1.",
        "The real Firebase credentials already stored in firebase.ts remain unchanged.",
        "All existing exports from firebase.ts (auth, RecaptchaVerifier, signInWithPhoneNumber) remain intact and compatible with their usage in App.tsx."
      ]
    }
  ],
  "constraints": [
    "Do not change or remove the real Firebase credentials already stored in frontend/src/firebase.ts.",
    "Do not modify any files under frontend/src/hooks/ or frontend/src/main.tsx.",
    "Do not break the existing localStorage-based auto-login (zweetiUser) flow.",
    "Do not alter the existing billing, GST toggle, daily sales report, or date-wise sales report functionality."
  ],
  "nonGoals": [
    "Changing the Firebase project or creating a new Firebase app instance.",
    "Adding new billing features or modifying the billing UI.",
    "Modifying backend/main.mo.",
    "Changing the visual theme or layout of the app."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}