{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update visual theme and add Download Bill button (ZWEETI Pro reference design)",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Update visual theme across App.tsx, BillingForm.tsx, and BillSummary.tsx to match ZWEETI Pro reference design with grey background, white card container, orange accents, and dashed borders",
      "acceptanceCriteria": [
        "Page background is grey (#f2f2f2)",
        "Card container is white, 420px wide, with rounded corners and a subtle box-shadow",
        "Headings and table header backgrounds use orange #ff5722",
        "Table row borders are dashed (#ccc)",
        "Layout is centered and mobile-friendly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add ZWEETI Pro theme variables and override page background to grey (#f2f2f2). Include custom CSS for orange accent color (#ff5722), dashed borders, and card container styles (white background, 420px width, rounded corners, box-shadow). Ensure print styles remain intact."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the root component layout to apply centered positioning and wrap the billing UI in a white card container with 420px max-width, rounded corners, and box-shadow. Apply orange (#ff5722) styling to the header/title. Ensure the layout is responsive and mobile-friendly."
        },
        {
          "path": "frontend/src/components/BillingForm.tsx",
          "operation": "modify",
          "description": "Apply ZWEETI Pro theme styling: use orange (#ff5722) for section headings and form labels. Ensure the form integrates with the card container layout and maintains the existing 13-item menu and functionality."
        },
        {
          "path": "frontend/src/components/BillSummary.tsx",
          "operation": "modify",
          "description": "Update table styling to use orange (#ff5722) for the header background and text, apply dashed borders (1px dashed #ccc) to table rows, and ensure totals section styling matches the ZWEETI Pro design. Preserve the existing remove button and totals calculation logic."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add a Download Bill button styled in blue (#2196f3) that generates and downloads a plain-text bill file (zweeti-bill.txt) and is hidden during print",
      "acceptanceCriteria": [
        "A 'Download Bill' button is visible next to the Print Bill button",
        "The button is styled with blue (#2196f3) background and white text",
        "Clicking the button triggers a file download named 'zweeti-bill.txt' containing the full bill details",
        "The Download Bill button is hidden when the browser's print dialog is triggered"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a Download Bill button in the actions area alongside the existing Print Bill button. Style it with blue background (#2196f3) and white text. Implement a click handler that generates a plain-text representation of the current bill (customer name, items with quantities and prices, subtotal, GST 5%, grand total) and triggers a browser download as 'zweeti-bill.txt'."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add print media query rule to hide the Download Bill button (using a specific class or data attribute) when the print dialog is triggered, ensuring it does not appear on printed bills."
        }
      ]
    }
  ]
}