{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement auto-login from localStorage and logout function for the login screen",
  "requirements": [
    {
      "id": "REQ-36",
      "summary": "Implement auto-login on component mount by checking localStorage for 'zweetiUser' and automatically showing the billing UI if present",
      "acceptanceCriteria": [
        "On page load, if localStorage contains the key 'zweetiUser', the login screen is not shown and the billing UI is displayed immediately.",
        "If localStorage does not contain 'zweetiUser', the login screen is shown as normal.",
        "The auto-login check runs once on component mount using a useEffect hook."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a useEffect hook that runs on component mount to check if 'zweetiUser' exists in localStorage. If present, set the isLoggedIn state to true to skip the login screen and show the billing UI directly. This replaces any window.onload logic with proper React lifecycle patterns."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Add logout function that clears 'zweetiUser' from localStorage and reloads the page, with a visible Logout button in the billing UI",
      "acceptanceCriteria": [
        "A 'Logout' button is visible in the main billing UI and hidden during print (using the no-print CSS class).",
        "Clicking 'Logout' removes the 'zweetiUser' key from localStorage.",
        "After logout, the page reloads and the login screen is displayed.",
        "The logout button is styled consistently with the existing action buttons (full-width, border-radius 8px, appropriate background color)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Create a logout function that removes the 'zweetiUser' key from localStorage and calls location.reload() to refresh the page. Add a 'Logout' button in the billing UI section (alongside or near other action buttons like 'Generate Invoice') with the 'no-print' class to hide it during print, styled consistently with existing buttons (full-width, rounded-lg, appropriate background color)."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Update login validation to require exactly 10 digits, show alert for invalid input, and store mobile number in localStorage under 'zweetiUser' on success",
      "acceptanceCriteria": [
        "If the entered mobile number is not exactly 10 digits, an alert displays 'Enter valid 10 digit mobile number' and the billing screen is not shown.",
        "If the entered mobile number is exactly 10 digits, it is stored in localStorage under the key 'zweetiUser'.",
        "After successful login, the login screen is hidden and the billing UI is shown.",
        "The existing inline error message approach in the login screen (if any) is reconciled with or replaced by this alert-based validation to match the reference script."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the login handler (Continue button click) to validate that the mobile number input is exactly 10 digits in length. If validation fails, show an alert with the message 'Enter valid 10 digit mobile number' and abort the login. If valid, store the mobile number in localStorage under the key 'zweetiUser', set isLoggedIn state to true, and show the billing UI. Replace or reconcile any existing inline error message approach with this alert-based validation."
        }
      ]
    }
  ]
}