{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Invoice Number and Date fields to the bill display",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Add auto-generated Invoice Number (ZWT-YYYYMMDD-XXXX format) and current Date (DD/MM/YYYY format) fields to the bill display in App.tsx, positioned above the customer name section with bold labels, and ensure both fields are included in print and PDF output",
      "acceptanceCriteria": [
        "An Invoice Number in the format ZWT-YYYYMMDD-XXXX is auto-generated and displayed on the bill card with the label 'Invoice No:' in bold.",
        "The current date is displayed on the bill card with the label 'Date:' in bold.",
        "Both Invoice No and Date appear above the customer name input, near the top of the bill card.",
        "Both fields are visible in the browser print output.",
        "Both fields are captured in the PDF generated by the Download Bill (html2pdf.js) button.",
        "The Invoice Number and Date fields are read-only and not editable by the user."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add state for invoiceNumber and billDate, generate invoiceNumber in the format ZWT-YYYYMMDD-XXXX using a useEffect hook on component mount or when a new bill is started, format billDate as DD/MM/YYYY, and render both fields with bold labels 'Invoice No:' and 'Date:' at the top of the bill card above the customer name input. Ensure both fields are included in the div that is passed to html2pdf.js for PDF generation and are visible in print media."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add print media query styles if needed to ensure the Invoice Number and Date fields are visible and properly formatted when printing the bill. Verify existing print styles cover the new fields or add specific rules for .invoice-info or similar classes."
        }
      ]
    }
  ]
}